#+STARTUP: showall
#+OPTIONS: toc:nil ^:{}
#+BEGIN_EXPORT html
---
title:  "Fix Browserpass on NixOS"
author: Eric Bailey
tags: nixos, pass, browserpass, firefox
---
#+END_EXPORT

After installing a custom version of Firefox, the [[https://github.com/browserpass/browserpass-extension][Browserpass extension]] stopped
working.

To fix it, I ran the following, based on a suggestion in the [[https://github.com/browserpass/browserpass-native/tree/3.0.6#install-on-nix--nixos][Browerpass host
application README]].

#+BEGIN_SRC bash :results results
make -C /run/current-system/sw/lib/browserpass DESTDIR=/run/current-system/sw hosts-firefox-user
#+END_SRC

#+RESULTS: fix firefox config
: make: Entering directory '/nix/store/wxqd9qs2mfgynh5v7zi72mfw0f81rkgg-browserpass-3.0.6/lib/browserpass'
: '/home/yurrriq/.mozilla/native-messaging-hosts/com.github.browserpass.native.json' -> '/run/current-system/sw/lib/browserpass/hosts/firefox/com.github.browserpass.native.json'
: make: Leaving directory '/nix/store/wxqd9qs2mfgynh5v7zi72mfw0f81rkgg-browserpass-3.0.6/lib/browserpass'
